{
    "October 2020": {
        "report_name": "Microsoft Patch Tuesday, October 2020",
        "file_name_prefix": "october2020",
        "cves_text": "CVE-2020-16953\nCVE-2020-16933\nCVE-2020-16980\nCVE-2020-16949\nCVE-2020-1047\nCVE-2020-16938\nCVE-2020-16891\nCVE-2020-16967\nCVE-2020-16950\nCVE-2020-17003\nCVE-2020-16921\nCVE-2020-16995\nCVE-2020-16973\nCVE-2020-16948\nCVE-2020-16876\nCVE-2020-16945\nCVE-2020-16916\nCVE-2020-16892\nCVE-2020-16894\nCVE-2020-16956\nCVE-2020-16936\nCVE-2020-16941\nCVE-2020-16975\nCVE-2020-16923\nCVE-2020-16924\nCVE-2020-16969\nCVE-2020-16895\nCVE-2020-16977\nCVE-2020-0764\nCVE-2020-16911\nCVE-2020-16908\nCVE-2020-16929\nCVE-2020-16920\nCVE-2020-16951\nCVE-2020-16952\nCVE-2020-16947\nCVE-2020-16932\nCVE-2020-16972\nCVE-2020-16922\nCVE-2020-16885\nCVE-2020-16968\nCVE-2020-16928\nCVE-2020-16974\nCVE-2020-16886\nCVE-2020-16957\nCVE-2020-16897\nCVE-2020-1243\nCVE-2020-16896\nCVE-2020-16863\nCVE-2020-1167\nCVE-2020-16910\nCVE-2020-16912\nCVE-2020-16939\nCVE-2020-16978\nCVE-2020-16887\nCVE-2020-16915\nCVE-2020-16890\nCVE-2020-1080\nCVE-2020-16904\nCVE-2020-16913\nCVE-2020-16918\nCVE-2020-16914\nCVE-2020-16946\nCVE-2020-16934\nCVE-2020-16902\nCVE-2020-16976\nCVE-2020-16943\nCVE-2020-16927\nCVE-2020-16942\nCVE-2020-16907\nCVE-2020-16930\nCVE-2020-16905\nCVE-2020-16889\nCVE-2020-16935\nCVE-2020-16900\nCVE-2020-16931\nCVE-2020-16955\nCVE-2020-16940\nCVE-2020-16899\nCVE-2020-16898\nCVE-2020-16901\nCVE-2020-16944\nCVE-2020-16937\nCVE-2020-16954\nCVE-2020-16877\nCVE-2020-16909\nCVE-2020-16919",
        "comments": {
            "qualys": "October 2020 Patch Tuesday – 87 Vulnerabilities, 11 Critical, SharePoint, TCP/IP Stack, Graphics, Adobe Vulns\nThis month’s Microsoft Patch Tuesday addresses 87 vulnerabilities with 11 of them labeled as Critical. The 11 Critical vulnerabilities cover TCP/IP Stack, SharePoint, Windows Camera Codec Pack, Graphics and several other workstation vulnerabilities. Adobe issued patches today for Adobe Flash Player.\nWorkstation Patches\nContinuing the trend, today’s Patch Tuesday fixes many vulnerabilities that impact workstations. The Windows Camera Codec, GDI+, Browser, Hyper-V, Outlook, Media Foundation and Graphics components vulnerabilities should be prioritized for workstation-type devices, meaning any system that is used for email or to access the internet via a browser. This includes multi-user servers that are used as remote desktops for users.\nWindows TCP/IP RCE\nAn extremely critical Remote Code Execution vulnerability (CVE-2020-16898) is fixed today. Microsoft ranks this vulnerability as “Exploitation More Likely,” and according to Microsoft and the researchers at McAfee, the vulnerability is wormable. It is highly recommended to prioritize these patches on all Windows 10, including Microsoft DNS Servers.\nThis vulnerability allows attackers to take complete control over Windows systems by sending malicious ICMPv6 Router Advertisement packets to vulnerable systems.\nSharePoint RCE\nTwo remote code execution vulnerabilities (CVE-2020-16951, CVE-2020-16952) are patched in Sharepoint Server that would allow an authenticated user on a guest system to perform security actions for an application pool process. Microsoft notes that exploitation of this vulnerability is less likely, but these patches should still be prioritized for all SharePoint servers.\nGraphics RCE\nA remote code execution vulnerability CVE-2020-16923 is patched in the Graphics component that could be exploited once a user opens a specially crafted file. Based on the information given, this should be prioritized across all Windows servers and workstations.\nAdobe\nAdobe issued patches today covering multiple vulnerabilities in Flash Player. The patches for Flash Player are labeled as Priority 2.\nWhile none of the vulnerabilities disclosed in Adobe’s release are known to be Actively Attacked today, all patches should be prioritized on systems with these products installed.\nAbout Patch Tuesday\nPatch Tuesday QIDs are published at Security Alerts, typically late in the evening of Patch Tuesday.",
            "tenable": "For the first time in seven months, Microsoft patches less than 100 CVEs, addressing 87 CVEs in its October release.\nMicrosoft patched 87 CVEs in the October 2020 Patch Tuesday release, including 11 CVEs rated critical. This release follows seven consecutive months of over 100 CVEs patched, in what has been an unusually busy year for Microsoft Patch Tuesday updates. This month's release includes fixes for Microsoft Windows, Microsoft Office and Microsoft Office Services and Web Apps, Microsoft JET Database Engine, Azure Functions, Azure Sphere, Open Source Software, Microsoft Exchange Server, Visual Studio, PowerShellGet, Microsoft .NET Framework, Microsoft Dynamics, Adobe Flash Player, and Microsoft Windows Codecs Library.\nCVE-2020-16898, dubbed “Bad Neighbor,” is a critical remote code execution (RCE) vulnerability within the Windows TCP/IP stack. The vulnerability exists due to improper handling of ICMPv6 Router Advertisement packets using Option Type 25 and an even length field. According to a blog post from McAfee, Microsoft Active Protections Program (MAPP) members were provided with a test script that successfully demonstrates exploitation of this vulnerability to cause a denial of service (DoS). While the test scenario does not provide the ability to pivot to RCE, an attacker could craft a wormable exploit to achieve RCE. While an additional bug would be required to craft an exploit, it is likely that we will see proof-of-concept (PoC) code released in the near future.\nSimilar to CVE-2020-16898, CVE-2020-16899 is a DoS vulnerability within the Windows TCP/IP stack. The vulnerability also results from the improper handling of ICMPv6 Router Advertisement packets. Exploitation of this flaw requires an attacker to send crafted ICMPv6 Router Advertisement packets which could cause the system to stop responding. While Microsoft does recommend applying the security update to patch this flaw, a workaround is available via a PowerShell command to disable ICMPv6 RDNSS (Recursive DNS Server) in the event the patch cannot be immediately applied.\nCVE-2020-16951 and CVE-2020-16952 are RCE vulnerabilities in Microsoft SharePoint resulting from a failure to validate an application package’s source markup. To exploit the vulnerability, an attacker would need to be able to upload a specially crafted SharePoint application package to a vulnerable SharePoint server. Successful exploitation could allow an attacker to execute arbitrary code under the context of the SharePoint application pool and the SharePoint server farm account.\nSteven Seeley, a security researcher on Qihoo 360’s Vulcan Team, is credited with discovering CVE-2020-16952. Seeley published an advisory on his website, which includes a PoC exploit script for the vulnerability.\nCVE-2020-16947 is an RCE flaw in Microsoft Outlook due to the improper handling of objects in memory. An attacker can exploit this vulnerability using a crafted email file sent to a user of a vulnerable version of Microsoft Outlook. Because Outlook’s Preview Pane is affected by this flaw, a user does not have to open the message in order for the vulnerability to be exploited. As Outlook is widely used for enterprise email, we highly recommend prioritizing the patching of this CVE.\nCVE-2020-16929, CVE-2020-16930, CVE-2020-16931 and CVE-2020-16932 are RCE vulnerabilities in Microsoft Excel because of the way the software improperly handles objects in memory. To exploit these vulnerabilities, an attacker must create a malicious Excel file and convince their target to open the file using a vulnerable version of Microsoft Excel, either by attaching the file to an email or hosting it on a website and enticing a user to visit the website. Successful exploitation would allow an attacker to gain arbitrary code execution on the vulnerable system with the same rights as the current user. Exploitation of this vulnerability could be exponentially worse if the current user has administrative privileges, which could grant the attacker the ability to perform a complete takeover of the vulnerable system.\nCVE-2020-16918 and CVE-2020-17003 are RCE vulnerabilities in Base3D because its rendering engine handles memory improperly. Successful exploitation of these vulnerabilities would allow an attacker to gain arbitrary code execution on a vulnerable system.\nCVE-2020-1167 and CVE-2020-16923 are RCE vulnerabilities in Microsoft Graphics Components because of the way objects are handled in memory. To exploit these vulnerabilities, an attacker must create a specially crafted file and convince their target to open the file. This could be achieved through targeted social engineering. Successful exploitation would allow an attacker to gain arbitrary code execution on the vulnerable system.\nCVE-2020-16891 is an RCE vulnerability on the host server of Windows Hyper-V when inputs from an authenticated user on the guest operating system (OS) are not properly validated. To exploit this vulnerability, an attacker would need to run a malicious application on the guest OS, which could result in arbitrary code execution on the host OS.\nUsers can create scans that focus specifically on our Patch Tuesday plugins. From a new advanced scan, in the plugins tab, set an advanced filter for Plugin Name contains October 2020.\nWith that filter set, click the plugin families to the left and enable each plugin that appears on the right side. Note: If your families on the left say Enabled, then all the plugins in that family are set. Disable the whole family before selecting the individual plugins for this scan. Here’s an example using March 2019 from Tenable.io:\nA list of all the plugins released for Tenable’s October 2020 Patch Tuesday update can be found here. As always, we recommend patching systems as soon as possible and regularly scanning your environment to identify those systems yet to be patched.\nJoin Tenable's Security Response Team on the Tenable Community.\nLearn more about Tenable, the first Cyber Exposure platform for holistic management of your modern attack surface.\nGet a free 30-day trial of Tenable.io Vulnerability Management.\nEnjoy full access to a modern, cloud-based vulnerability management platform that enables you to see and track all of your assets with unmatched accuracy. Sign up now.\nEnjoy full access to a modern, cloud-based vulnerability management platform that enables you to see and track all of your assets with unmatched accuracy. Purchase your annual subscription today.\nChoose Your Subscription Option:\nNessus® is the most comprehensive vulnerability scanner on the market today. Nessus Professional will help automate the vulnerability scanning process, save time in your compliance cycles and allow you to engage your IT team.\nNessus® is the most comprehensive vulnerability scanner on the market today. Nessus Professional will help automate the vulnerability scanning process, save time in your compliance cycles and allow you to engage your IT team.\nBuy a multi-year license and save. Add Advanced Support for access to phone, community and chat support 24 hours a day, 365 days a year. Full details here.\nEnjoy full access to our latest web application scanning offering designed for modern applications as part of the Tenable.io platform. Safely scan your entire online portfolio for vulnerabilities with a high degree of accuracy without heavy manual effort or disruption to critical web applications. Sign up now.\nEnjoy full access to a modern, cloud-based vulnerability management platform that enables you to see and track all of your assets with unmatched accuracy. Purchase your annual subscription today.\n$3,578\nBuy Now\nEnjoy full access to the only container security offering integrated into a vulnerability management platform. Monitor container images for vulnerabilities, malware and policy violations. Integrate with continuous integration and continuous deployment (CI/CD) systems to support DevOps practices, strengthen security and support enterprise policy compliance.\nTenable.io Container Security seamlessly and securely enables DevOps processes by providing visibility into the security of container images – including vulnerabilities, malware and policy violations – through integration with the build process.\nPlease fill out the form below with your contact information and a sales representative will contact you shortly to schedule a demo. You may also include a short comment (limited to 255 characters). Please note that fields with asterisks (*) are mandatory.\nVisualize and explore your Cyber Exposure, track risk reduction over time and benchmark against your peers with Tenable Lumin.\nContact a Sales Representative to see how Lumin can help you gain insight across your entire organization and manage cyber risk.\nGet the Operational Technology Security You Need.\nReduce the Risk You Don’t.",
            "rapid7": "Microsoft brings us an October's Update Tuesday with 87 vulnerabilities, a sub-100 number we haven't experienced in quite some time. To further add to this oddity, there are no Browser-based vulnerabilities to mention and the arrival of a new Adobe Flash vulnerability CVE-2020-9746. Despite this month's lower numbers, there are some precautions we should all take to remediate our environments quickly and effectively. \nStarting with Microsoft Windows\nAs usual, whenever possible, it's better to prioritize updates against the Windows operating system. Coming in at 53 of the 87 vulnerabilities, patching the OS knocks out 60% of the vulnerabilities listed along with over half of the critical remote code execution vulnerabilities resolved today. \nMicrosoft CVE-2020-16898: Microsoft TCP/IP Remote Code Execution Vulnerability. With a CVSS score of 9.8 and marked as \"Exploitation More Likely\", this vulnerability grants the ability to execute code on target Windows 10 (version 1709+), Windows Server 2019, and Windows Server version 1903+ systems due to improper handling of ICMPv6 Router Advertisement packets. \nLuckily, if immediate patching isn't viable due to reboot scheduling, Microsoft provides PowerShell-based commands to disable ICMPv6 RDNSS on affected operating systems. The PowerShell command\nnetsh int ipv6 set int *INTERFACENUMBER* rabaseddnsconfig=disable does not require a reboot to take effect. \nMicrosoft CVE-2020-16896: Windows Remote Desktop Protocol (RDP) Information Disclosure Vulnerability. RDP has been a focal point for some of recent attacks (e.g. BlueKeep), so whenever Microsoft provides another fix within that realm, it's prudent to make note of some specifics. CVE-2020-16896 is an information disclosure vulnerability where, when successfully exploited, allows unauthorized read access to the Windows RDP server process. \nThis RDP vulnerability, like previous ones of late, affects all supported Windows operating systems, and can continue to be mitigated by practices such as enabling Network Level Authentication (NLA) or by blocking TCP port 3389 at the enterprise perimeter firewall. \nMicrosoft CVE-2020-16911: GDI+ Remote Code Execution Vulnerability. Critical remote code execution vulnerability CVE-2020-16911 leverages how the Windows Graphics Device Interface (GDI) handles objects in memory. A successful exploitation allows the attacker to install programs and/or create new accounts under the same user rights as the user who triggered this vulnerability. \nA mitigating factor here is that users with fewer privileges on the system could be less impacted, but still emphasizes the importance of good security hygiene as exploitation requires convincing a user to open a specially-crafted file or to view attacker-controlled content. \nUnlike CVE-2020-16898, however, this vulnerability affects all supported versions of Windows OS, which may suggest affecting unsupported/earlier versions of Windows as well. \nMoving on to Microsoft SharePoint\nContinuing last month's trend, there are more SharePoint-related vulnerabilities being addressed this month (10 of them) than past months. If relevant in your environment, the respective KBs for your version of SharePoint should be the next batch of patches to prioritize. Below are some highlights of the higher CVSS-scored ones. \nMicrosoft SharePoint Remote Code Execution Vulnerabilities (CVE-2020-16951, CVE-2020-16952). With Proof-of-Concept exploits starting to flow out in the wild, bringing a closure to this pair of critical remote code execution vulnerabilities is a must. \nCVE-2020-16951 and CVE-2020-16952 are remote code execution vulnerabilities that exploit a gap in checking the source markup of an application package. Upon successful exploitation, the attacker could run arbitrary code in the context of the SharePoint application pool or server farm account. \nFor more in-depth attacker perspective, visit AttackerKB's take on CVE-2020-16952. \nMicrosoft SharePoint Reflective XSS Vulnerabilities (CVE-2020-16944, CVE-2020-16945, CVE-2020-16946). The last set of notable SharePoint vulnerabilities this month are three CVSS 8.7 spoofing vulnerabilities. Requiring a user to click a specially-crafted URL within targeted SharePoint Web App site, a successful exploitation from those means allows the attacker to perform cross-site scripting attacks and/or run scripts in the security context of the user. \nClosing October's Update Tuesday journey with Microsoft Office\nWhile we always expect Office-based vulnerabilities every month, two vulnerabilities particularly stood out. In both cases, the Preview Pane is considered an attack vector, which lowers the barriers to entry a bit. \nMicrosoft CVE-2020-16947: Outlook Remote Code Execution Vulnerability. A critical remote code execution vulnerability for Outlook 2016, Office 2019 and Microsoft 365 apps only, CVE-2020-16947 has the potential to allow an attacker to run arbitrary code in the context of the user. The attacker could then install programs or create new accounts with full user rights. \nWhile the details behind this vulnerability feels standard from Microsoft's description, it actively acknowledges that the Preview Pane is an attack vector, and that in itself, attracts some attention. \nMicrosoft CVE-2020-16949: Outlook Denial of Service Vulnerability. CVE-2020-16949 is an Outlook vulnerability that affects more versions than the list around CVE-2020-14947 including Outlook 2010 and Outlook 2013. This vulnerability, however, reads differently in that this denial of service vulnerability only requires that a specially-crafted email be sent. When paired with the fact that this vulnerability is marked with the Preview Pane as an attack vector, just like CVE-2020-16947, suggests giving Outlook its fair share of attention this month. \nNote: Graph data is reflective of data presented by Microsoft's CVRF at the time of writing. \n",
            "zdi": "The October 2020 Security Update Review\nOctober is here and with it comes the latest security offerings from Adobe and Microsoft. Take a break from your regularly scheduled activities and join us as we review the details of security patches for this month. \nAdobe Patches for October 2020\nAdobe released only one patch for October. It fixes a single vulnerability in Flash, which reaches it end-of-life (EOL) at the end of this year. The patch corrects a NULL pointer Dereference bug. These types of bugs rarely lead to security problems as they usually generate an immediate segmentation fault error. However, Adobe states this vulnerability can lead to an exploitable crash and result in code execution in the context of the current user. Considering Flash is so close to its EOL, there’s the possibility this is the last patch we see for the once ubiquitous media player. \nMicrosoft Patches for October 2020\nFor October, Microsoft released patches to correct 87 CVEs in Microsoft Windows, Office and Office Services and Web Apps, Azure Functions, Open Source Software, Exchange Server, Visual Studio, .NET Framework, Microsoft Dynamics, and the Windows Codecs Library. That ends the streak of more than 110 CVEs being fixed at seven months (March through September), but you’re not likely to hear any complaints. Microsoft is still on pace to double its CVE count from 2017, but hopefully, the last few months of 2020 will see this lighter load. \nOf these 87 patches, 11 are listed as Critical while 75 are listed as Important, and one is listed as Moderate in severity. A total of 11 of these bugs came through the ZDI program. None of these bugs are listed as being under active attack, but six bugs are listed as publicly known at the time of release. Let’s take a closer look at some of the more severe bugs in this release, starting with a bug in the TCP/IP stack that is sure to get some notice:\nCVE-2020-16898 – Windows TCP/IP Remote Code Execution Vulnerability. This patch corrects a problem in the TCP/IP stack caused by the way it handles ICMPv6 router advertisements. A specially crafted ICMPv6 router advertisement could cause code execution on an affected system. Since the code execution occurs in the TCP/IP stack, it is assumed the attacker could execute arbitrary code with elevated privileges. If you’re running an IPv6 network, you know that filtering router advertisements is not a practical workaround. Microsoft also gives this bug its highest exploitability rating, so exploits are likely. You should definitely test and deploy this patch as soon as possible. \nCVE-2020-16947 - Microsoft Outlook Remote Code Execution Vulnerability. This vulnerability was reported through the ZDI program, and it could allow code execution on affected versions of Outlook just by viewing a specially crafted e-mail. The Preview Pane is an attack vector here, so you don’t even need to open the mail to be impacted. The specific flaw exists within the parsing of HTML content in an email. The issue results from the lack of proper validation of the length of user-supplied data before copying it to a fixed-length heap-based buffer. Although Microsoft gives this an XI rating of 2, we have a working proof-of-concept. Patch this one quickly. \nCVE-2020-16891 - Windows Hyper-V Remote Code Execution Vulnerability. This patch corrects a bug that allows an attacker to run a specially crafted program on an affected guest OS to execute arbitrary code on the host OS. The write up doesn’t say at what permission level the code execution occurs, but that shouldn’t stop you from rolling this out to your Hyper-V servers quickly. \nCVE-2020-16909 - Windows Error Reporting Elevation of Privilege Vulnerability. This is one of the six bugs listed as publicly known for this month. The patch corrects an escalation of privilege (EoP) in the Windows Error Reporting (WER) component that could allow an authenticated attacker to execute arbitrary code with escalated privileges. Although this CVE is not listed as being publicly exploited, bugs in this component have been reported as being used in the wild in fileless attacks. Regardless, this and the other bugs in the WER component being fixed this month should not be ignored. \nHere’s the full list of CVEs released by Microsoft for October 2020. \nOf the remaining publicly known bugs, two are EoP bugs in the Windows Setup component and the Windows Storage VSP Driver. The remaining public bugs are information disclosure bugs in the kernel and .NET Framework. These info disclosure bugs leak the contents of kernel memory but do not expose any personally identifiable information. \nChecking on the remaining Critical-rated bugs, two impact the Windows Camera Codec and were reported by ZDI vulnerability researcher Hossein Lotfi. These bugs result from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated buffer. Sticking with the media theme, there are also code execution bugs in Media Foundation Library, Base3D rendering engine, Graphics components, and GDI+. The final Critical-rated bugs are code execution vulnerabilities in SharePoint Server. In both cases, the attacker would need to upload a specially crafted SharePoint application package to an affected version of SharePoint to get arbitrary code execution. This can be accomplished by an unprivileged SharePoint user if the server’s configuration allows it. \nMoving on to the Important-rated bugs, the first that pops out is a spoofing bug in Windows that could allow an attacker to loaded improperly signed files. This could also be considered a security feature bypass (SFB) since Windows is designed to only load files with valid signatures. A different bug that is listed as an SFB could allow an attacker to create files in a protected Unified Extensible Firmware Interface (UEFI) location. Another interesting SFB being fixed this month resides in Word when it improperly handles .LNK files. An attacker could perform actions in the context of whoever opens a specially crafted Word doc. While not arbitrary code execution, it certainly can be useful for attackers. A final SFB exists in PowerShell. This one could allow an attacker to bypass the Windows Defender Application Control (WDAC) policy and execute arbitrary code on a policy locked-down machine. \nIncluding the cases previously mentioned, there are 36 patches to address EoP bugs this month. While this is a lower number than some other months, it still represents 42.5% of the total release for October. In almost all of these cases, an attacker would need to log on to an affected system and run their application. Affected components include Office Click-to-Run, the Backup Service, Azure Functions, Dynamics 365, Group Policy, and Windows COM. Also getting an EoP patch is the Network Watcher Agent Virtual Machine Extension for Linux. However, to get this update, you’ll need to manually update the Network Watcher Agent virtual machine extensions. As someone who has been in the industry for a while, it’s still odd to see Microsoft release patches for Linux. It’s a welcome change. \nMoving on to the Denial-of-Service (DoS) bugs, there are only five this month, and one of those is rated Moderate. However, there is a DoS in the TCP/IP similar to the RCE bug previously mentioned. In this case, malformed ICMPv6 Router Advertisements could cause a system to stop responding. Not quite as bad as code execution, but not good. There are also two DoS bugs in the Remote Desktop Protocol and Hyper-V server. \nThere are 15 information disclosure bugs receiving patches this month, including those previously mentioned. For the most part, the information leaked consists of unspecified memory contents. Not so for the info disclosure bug in Microsoft Exchange. This improper token validation bug could potentially leak IDs, tokens, nonces, and other sensitive information. According to the write-up, an attacker could exploit this by sending specially crafted OWA messages that could be loaded without warning or filtering. Information disclosure bugs can be easy to overlook, but don’t discount this one. Finally, this month’s release is rounded out by five cross-site scripting (XSS) bugs in Dynamics 365 (On-Premise) and SharePoint Server. \nLooking at the advisories for October, the first is Microsoft’s version of the aforementioned patch for Flash in Internet Explorer. The other is the update to the Windows Servicing Stack, which adds updates for all supported versions of Windows. \nLooking Ahead\nThe next Patch Tuesday falls on November 10, and we’ll return with details and patch analysis then. Until then, stay safe, enjoy your patching, and may all your reboots be smooth and clean!\n"
        }
    }
}